using UnityEngine;
using System.Collections;
using System.Collections.Generic;

public class Essay
{
    private string[] texts;    //全部的文本
    private string[] names;    //按对话顺序的名字文本
    private int[] mark;        //头像播放顺序

    public string[] Texts
    {
        get
        {
            return texts;
        }

        set
        {
            texts = value;
        }
    }

    public string[] Names
    {
        get
        {
            return names;
        }

        set
        {
            names = value;
        }
    }

    public int[] Mark
    {
        get
        {
            return mark;
        }

        set
        {
            mark = value;
        }
    }

    public Essay(string[] m_Texts, string[] m_Names, int[] m_Mark)
    {
        this.texts = m_Texts;
        this.names = m_Names;
        this.mark = m_Mark;
    }
}

public class TalkText : MonoBehaviour
{

    // Use this for initialization
    

    public Dictionary<int, Essay> m_EssayInfo = new Dictionary<int, Essay> {
        { 1001, new Essay(
            new string[1]{
                ""
            },
            new string[1]{
                "工会内"
            },
            new int[1]{3})
        },
        { 1002, new Essay(
            new string[12]{
                "今天就要从勇者工会毕业了呢~克萝莉亚",
                "是啊，终于可以摆脱”见习”的帽子，向着未知的冒险进发了呢！",
                "不过这样真的好吗，其实我感觉你还是挺冒失的，真的有那份觉悟去与魔物交手吗",
                "嘛嘛，凡事都是从小白到熟练的嘛，我可不认为我会败下阵来哦~",
                "那么那么~我的第一个任务是？",
                "别着急嘛，不是还有一件必要的事要做吗",
                "诶？是什么事？",
                "当然是组队啦，勇者工会为了每个新晋勇者的安全，会预先匹配工会认为适合你的队友啊",
                "这些都没记住吗，怎么会让你毕业的啊",
                "啊，这件事啊，这件事我当然记得啊，哈哈哈……",
                "不要想萌混过关了，真是的，为你分的队友就在[那里]了，希望他们能管好你啊",
                "好吧好吧，我知道了（去见你的队友吧）"
            },
            new string[12]{
                "勇者工会主管",
                "克萝莉亚",
                "勇者工会主管",
                "克萝莉亚",
                "克萝莉亚",
                "勇者工会主管",
                "克萝莉亚",
                "勇者工会主管",
                "勇者工会主管",
                "克萝莉亚",
                "勇者工会主管",
                "克萝莉亚"
            },
            new int[12]{3,0,3,0,0,3,0,3,3,0,3,0})
        },
        { 1003, new Essay(
            new string[9]{
                "那个…，你的名字是？",
                "西露达，主修魔法……",
                "好吧，我是帕吉尔，职业是圣职，今后的冒险，还要多多指教了哦",
                "多多指教……",
                "哈~（不爱说话的人啊）",
                "（按照以往勇者公会的做法，往往会将性格差距较大的人分在一组）",
                "（之前认识的人为了不和笨蛋分在一组，在勇者公会里就表现得和笨蛋一样）",
                "（不过看样子，她只是不爱说话而已，不像鲁莽做事的人）",
                "（毕竟选择勇者这个职业，能力差可是不能胜任啊……）"
            },
            new string[9]{
                "帕吉尔",
                "西露达",
                "帕吉尔",
                "西露达",
                "帕吉尔",
                "帕吉尔",
                "帕吉尔",
                "帕吉尔",
                "帕吉尔"
            },
            new int[9]{2,1,2,1,2,2,2,2,2})
        },
        { 1004, new Essay(
            new string[4]{
                "你们好啊，工会主管告诉我，你们就是我的队友了~",
                "是吗，太好了，那我们先坐下来谈谈吧……",
                "不不不，比起坐下来谈谈，我更想去领我们的第一个任务，来来来，我们一起去工会主管那里吧~",
                "额，等一下啊……"
            },
            new string[4]{
                "克萝莉亚",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔"
            },
            new int[4]{0,2,0,2})
        },
        { 1005, new Essay(
            new string[17]{
                "工会主管，我们三人小队到齐了，我们的任务是什么？",
                "这么快就回来了吗，你们互相了解了吗，确定可以执行任务了吗",
                "额，这个当然！",
                "当然什么啊，我们甚至连名字都不知道啊！",
                "呃呃……",
                "算了算了，我是帕吉尔，职业是圣职，这位是西露达，职业是魔法师，我想现在了解一下你的职业，等一会我们就去完成勇者该干的事情，怎么样？",
                "好啊，我是克萝莉亚，是主修弓的猎人哦，要是来比箭术我可不会输给你啊",
                "我肯定不会和你比箭术啊，我又不常使用弓……",
                "不过我们的阵容还不错，可以打出物理攻击和魔法攻击，我也具备一定的保护能力",
                "唯一欠缺的是缺少近战输出，对于防御高的敌人比较苦手，不过打不过跑也应该是可以的……",
                "没错，我们公会也是有所考虑的，帕吉尔，希望你可以带领好她们。",
                "什么啊，队伍之间不是这样的关系吧~",
                "总而言之，我要给你们发布任务了，第一个任务比较简单，也算是一个证明你们毕业的任务",
                "最近其实人界与魔界的封印越来越弱了，其实你们也能感受到，村外野兽也变得凶恶起来",
                "你们的任务就是将村周围的野猪驱逐出去，因为野猪变得很凶猛，所以希望你们抱着杀死他们的觉悟来干这件事",
                "我们会派这一届的所有队伍去做这件事，每队只要带回来5个野猪皮回来就好",
                "越快达成这个任务，在下次分配任务时会考虑哦"
            },
            new string[17]{
                "克萝莉亚",
                "勇者工会主管",
                "克萝莉亚",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "帕吉尔",
                "帕吉尔",
                "勇者工会主管",
                "克萝莉亚",
                "勇者工会主管",
                "勇者工会主管",
                "勇者工会主管",
                "勇者工会主管",
                "勇者工会主管"
            },
            new int[17]{0,3,0,2,0,2,0,2,2,2,3,0,3,3,3,3,3})
        },
        { 1006, new Essay(
            new string[4]{
                "明白了，我们出发吧！",
                "好吧，有我在应该没什么问题吧",
                "~~",
                "（任务1:收集5个野猪皮）"
            },
            new string[4]{
                "克萝莉亚",
                "帕吉尔",
                "西露达",
                "克萝莉亚"
            },
            new int[4]{0,2,1,0})
        },
        { 1007, new Essay(
            new string[31]{
                "你们回来了啊，在所有队伍中也是数一数二的快呢",
                "那是当然啦~哈哈哈~",
                "醒醒吧……工会主管这么说，肯定是有比我们更快的组合呢……",
                "诶诶，是这样吗？？",
                "帕吉尔还是很敏锐啊，确实如此……",
                "是怎么样的一队呢，我有点兴趣……",
                "他们这一队和你们很相似，各种意义上……",
                "相信你们在任务过程中，西露达是功劳最大的吧",
                "嘛，确实……在战斗层面上来说，西露达确实比较强",
                "这一队也有一位和西露达相同作用的人哦",
                "是吗，那具体详情……",
                "哎呀哎呀，这个就不便透露了啊",
                "（和我相同作用的人……吗）",
                "我大概知道那一队的那个人了",
                "哦，是吗，那……",
                "以后再说吧……",
                "有时间的话……",
                "哈~好吧",
                "诶诶，不管那支厉害的队伍了，我等不及来领下一个任务了！",
                "哈哈，这才是正题吧，那公会这边就给你们一个稍微困难一点的任务吧",
                "毕竟是我们这种优秀的队伍呢！",
                "困难，其实就是危险呢……",
                "这么说确实是对的，这次的任务需要你们去离村庄比较远的的地方，驱逐黑野猪，魔界会有一些力量使动物们魔化，如果在道路上出现会对人们造成威胁，希望你们与公会的众多勇者团一起驱逐它们",
                "啊，那里距离魔界很近呢，我们可以进去魔界逛逛吗~",
                "显然不行啊……",
                "通往魔界的道路勇者公会会派人把守着，只有被承认的勇者才可以进入哦",
                "总之你们不会被许可进入魔界的了",
                "好吧……",
                "那么任务的形式还是一样，通过收集黑野猪皮来证明你们的功绩，明白了吗？",
                "ok~",
                "（任务2:收集5个黑野猪皮）"
            },
            new string[31]{
                "勇者工会主管",
                "克萝莉亚",
                "帕吉尔",
                "克萝莉亚",
                "勇者工会主管",
                "帕吉尔",
                "勇者工会主管",
                "勇者工会主管",
                "帕吉尔",
                "勇者工会主管",
                "帕吉尔",
                "勇者工会主管",
                "西露达",
                "西露达",
                "帕吉尔",
                "西露达",
                "西露达",
                "帕吉尔",
                "克萝莉亚",
                "勇者工会主管",
                "克萝莉亚",
                "帕吉尔",
                "勇者工会主管",
                "克萝莉亚",
                "帕吉尔",
                "勇者工会主管",
                "勇者工会主管",
                "克萝莉亚",
                "勇者工会主管",
                "克萝莉亚",
                "克萝莉亚"
            },
            new int[31]{3,0,2,0,3,2,3,3,2,3,2,3,1,1,2,1,1,2,0,3,0,2,3,0,2,3,3,0,3,0,0})
        },
        { 1008, new Essay(
            new string[8]{
                "呼~今天的任务果然要难很多啊",
                "是啊，不但要击败黑野猪，反而找黑野猪更难啊~",
                "其实……",
                "去靠近魔界的森林里冒险，会遇到很多黑野猪……",
                "可是那样的话，就起不到驱逐黑野猪的效果了啊~~",
                "说的也是……",
                "好了，不管怎么说，任务也完成了，虽然完成时间上不会是那么优秀了……",
                "回去交付任务吧！"
            },
            new string[8]{
                "克萝莉亚",
                "帕吉尔",
                "西露达",
                "西露达",
                "克萝莉亚",
                "西露达",
                "帕吉尔",
                "克萝莉亚"
            },
            new int[8]{0,2,1,1,0,1,2,0})
        },
        { 1009, new Essay(
            new string[3]{
                "（……！！）",
                "啊啊……似乎是熟人过来了……",
                "什么，西露达"
            },
            new string[3]{
                "西露达",
                "西露达",
                "克萝莉亚"
            },
            new int[3]{1,1,0})
        },
        { 1010, new Essay(
            new string[4]{
                "西露达，好久不见啊~",
                "艾斯迪儿……",
                "哦，艾斯迪儿，是你的熟人吗，要不一起过来坐下吃点东西吧~",
                "好吧，那我们交付完任务就回来。"
            },
            new string[4]{
                "艾斯迪儿",
                "西露达",
                "塞拉斯",
                "帕吉尔"
            },
            new int[4]{3,1,3,2})
        },
        { 1011, new Essay(
            new string[28]{
                "……",
                "所以说，那时工会主管说的是艾斯迪儿吗",
                "？？那个唠叨的工会主管，又说什么了吗？",
                "当时工会主管说，我们之所以这么快完成任务，其实很仰仗西露达 和 艾斯迪儿呢",
                "其实我也很需要战士保护啦……",
                "艾斯迪儿很强的，我还差得远……",
                "其实对于女孩子来说，强弱都不重要呢~",
                "什么啊，我觉得还是强一点好啊~",
                "哈哈，这一届新晋勇者团中最强的两支队伍已经到这里了啊",
                "是啊，在交付任务的时候，工会主管也说交付任务的顺序和上一次一模一样呢。",
                "是啊是啊~ 一 模 一 样 呢 ~",
                "……",
                "塞拉斯，还真坏呢~",
                "该说他是争强好胜，还是小心眼呢……",
                "哈……",
                "怎么了怎么了？",
                "其实他这个人啊，比较在意孰强孰弱，遇到比较强的人总是想比一下……",
                "在完成任务时，也是觉得魔界的森林里的黑野猪比较强，拉着我们去那里呢",
                "哈~这样的话驱逐的效果不是不会很好吗？",
                "是啊，我们为了找黑野猪，可是花了 好 多 时 间 呢~",
                "（你是他的clone吗……）",
                "好吧，要不之后我们较量一下看看怎么样？",
                "求之不得！",
                "挺有趣的样子呢，来一场3v3吧",
                "西露达，要不也来切磋一下吧，我也想知道你变的有多厉害呢",
                "好吧……",
                "诶~好麻烦欸……怎么大家都那么有兴趣啊！",
                "那么，就在村外森林比试吧，我们准备一下就出发吧。"
            },
            new string[28]{
                "",
                "帕吉尔",
                "艾斯迪儿",
                "帕吉尔",
                "艾斯迪儿",
                "西露达",
                "梅提拉",
                "克萝莉亚",
                "塞拉斯",
                "帕吉尔",
                "塞拉斯",
                "帕吉尔",
                "梅提拉",
                "艾斯迪儿",
                "西露达",
                "克萝莉亚",
                "艾斯迪儿",
                "艾斯迪儿",
                "克萝莉亚",
                "帕吉尔",
                "西露达",
                "塞拉斯",
                "帕吉尔",
                "克萝莉亚",
                "艾斯迪儿",
                "西露达",
                "梅提拉",
                "塞拉斯"
            },
            new int[28]{3,2,3,2,3,1,3,0,3,2,3,2,3,3,1,0,3,3,0,2,1,3,2,0,3,1,3,3})
        },
        { 1012, new Essay(
            new string[15]{
                "……",
                "果然厉害啊",
                "哈，虽然我先下一程，但你们确实很强啊",
                "那我要来真的了！可别死了啊！",
                "停停停！再这样下去，就不是切磋了！",
                "好累哦，好想睡觉~",
                "可是，现在停下，岂不是像输了吗……",
                "梅提拉，我们不要管塞拉斯了，回去睡觉好了~~",
                "好的呢~~",
                "诶~~~~~~?",
                "那我们先走啦~",
                "呼~心情舒畅啊~",
                "我说，其实帕吉尔你也挺好胜啊",
                "（男人都是笨蛋啊…………）",
                "那我们去领下一个任务吧，每次被他们抢先完成任务，其实还是不太爽的"
            },
            new string[15]{
                "",
                "塞拉斯",
                "帕吉尔",
                "塞拉斯",
                "艾斯迪儿",
                "梅提拉",
                "塞拉斯",
                "艾斯迪儿",
                "梅提拉",
                "塞拉斯",
                "艾斯迪儿",
                "帕吉尔",
                "克萝莉亚",
                "西露达",
                "帕吉尔"
            },
            new int[15]{3,3,2,3,3,3,3,3,3,3,3,2,0,1,2})
        },
        { 1013, new Essay(
            new string[1]{
                "（可以去公会领下一个任务了）"
            },
            new string[1]{
                ""
            },
            new int[1]{3})
        },
        { 1014, new Essay(
            new string[9]{
                "你们好啊~",
                "我们来接下一个任务了",
                "我们公会认为，你们已经足够胜任成熟勇者团的任务了",
                "所以接下来的任务，都是一步走错，都会生死攸关的任务哦",
                "我们已经有觉悟了",
                "我们可是最强的呢~",
                "那我就公布任务了，去收集黑暗森林的幽魂之精吧，击败幽魂就可以获得了",
                "黑暗森林已经可以进入了，但是，想要去找到幽魂，还是需要你们的智勇啊",
                "ok~"
            },
            new string[9]{
                "勇者工会主管",
                "帕吉尔",
                "勇者工会主管",
                "勇者工会主管",
                "帕吉尔",
                "克萝莉亚",
                "勇者工会主管",
                "勇者工会主管",
                "克萝莉亚"
            },
            new int[9]{3,2,3,3,2,0,3,3,0})
        },
        { 1015, new Essay(
            new string[1]{
                "解密关（略）"
            },
            new string[1]{
                ""
            },
            new int[1]{3})
        },
        { 1016, new Essay(
            new string[3]{
                "呜~第一次进入黑暗森林，感觉确实比野猪之流危险很多啊",
                "呼，我射掉了好多只箭啊，回去还是多买一点吧……",
                "不管怎么样，回去交任务吧，顺便看看有没有新的任务"
            },
            new string[3]{
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔"
            },
            new int[3]{2,0,2})
        },
        { 1017, new Essay(
            new string[15]{
                "回来交付任务了吗，还是一如既往的有效率呢",
                "是啊，我们想知道还有什么任务没",
                "有一个超过你们现有实力的任务……收集恶魔之精",
                "什么，那么岂不是要深入魔界，与恶魔交锋，才可以得手吗？",
                "其实现在，勇者团特别多，任务都已经分发下去了，即使考虑到魔界的资源利用，也不会有更多比较适合你们的任务了",
                "其实我觉得没有任务也很好啊，其实只要我们驱逐掉村庄周围的魔物就可以了吧~",
                "虽然如此，其实我们勇者啊，没有魔物，其实就是失业了啊……",
                "失业会怎么样呢？我觉得这样也可以啊，成为勇者的目的，其实就是要保护大家啊",
                "哈哈~也许是这样吧，其实，我成为勇者，还是希望能够得到大家的尊敬",
                "所以，我想变得更强啊……",
                "难怪你每次结付任务，都那么积极……",
                "那我们接不接受这个任务呢，这个任务，确实可能对我们来说比较危险……",
                "去吧……",
                "嘛，毕竟我们都无所谓啦，要是你想要去的话，我们就陪你去吧~",
                "嘿嘿，那么我们就走吧~"
            },
            new string[15]{
                "勇者工会主管",
                "帕吉尔",
                "勇者工会主管",
                "帕吉尔",
                "勇者工会主管",
                "克萝莉亚",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "西露达",
                "克萝莉亚",
                "帕吉尔"
            },
            new int[15]{3,2,3,2,3,0,2,0,2,2,0,2,1,0,2})
        },
        { 1018, new Essay(
            new string[14]{
                "没想到，你们真的把恶魔之精收集到了~",
                "是啊，这可是货真价实的恶魔之精哦~",
                "诶，费了好大的力才获得呢……",
                "累啊……",
                "哈哈，这下我们的声望肯定就会更高了",
                "是啊，你们虽然年轻，但是却感觉已经是这个公会的最厉害的一批人了！！",
                "要不你们去王城吧，我感觉你们的潜力不该局限在这个小镇里",
                "真的可以吗？",
                "王城啊，听起来好像很好玩的样子呢",
                "……",
                "怎么了，西露达，不想见识一下王城吗？",
                "没什么……只是讨厌人多而已……",
                "不过我对王城，也有一点兴趣吧……",
                "那么，我们就出发去王城吧~"
            },
            new string[14]{
                "勇者工会主管",
                "帕吉尔",
                "克萝莉亚",
                "西露达",
                "帕吉尔",
                "勇者工会主管",
                "勇者工会主管",
                "帕吉尔",
                "克萝莉亚",
                "西露达",
                "帕吉尔",
                "西露达",
                "西露达",
                "克萝莉亚"
            },
            new int[14]{3,2,0,1,2,3,3,2,0,1,2,1,1,0})
        },
        { 1019, new Essay(
            new string[2]{
                "总算到达王城了啊，我们先去附近的旅店住一晚上吧",
                "ok~"
            },
            new string[2]{
                "帕吉尔",
                "克萝莉亚"
            },
            new int[2]{2,0})
        },
        { 1020, new Essay(
            new string[19]{
                "话说，西露达，在这一路上，你作为勇者的确很优秀",
                "嗯·……",
                "可是我却搞不清楚，你是为什么来做勇者呢？",
                "是啊，我总是感觉，西露达一向无欲无求的样子……",
                "这个啊……",
                "不过是为了生存下来而已……",
                "我的魔力，其实是一种天赋……",
                "有这样的天赋，做勇者是最合适的……",
                "的确，这样的实力，不做勇者确实可惜了",
                "诶？我倒是觉得，你可以去做图书管理员之类的啊，和你很搭啊",
                "怎么会？去做这些这样的天赋岂不是浪费了吗？",
                "哦……其实这样也好啦……",
                "唉~虽然到了王城，可是要得到这里的承认，感觉可不是一件容易的事啊",
                "说不定要花费好多时间才能被这里认同呢",
                "所以我们也不能一直无所事事，要提高自己的声望啊~",
                "提高声望吗，参加这一届的勇者竞技怎么样？",
                "勇者竞技？那是什么？",
                "貌似是王国的勇者都会参加一个竞技，我也只是道听途说而已啦……",
                "原来如此啊，明天去王城勇者公会问问吧"
            },
            new string[19]{
                "帕吉尔",
                "西露达",
                "帕吉尔",
                "克萝莉亚",
                "西露达",
                "西露达",
                "西露达",
                "西露达",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "西露达",
                "帕吉尔",
                "帕吉尔",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔"
            },
            new int[19]{2,1,2,0,1,1,1,1,2,0,2,1,2,2,2,0,2,0,2})
        },
        { 1021, new Essay(
            new string[17]{
                "你们好，请问有什么事吗？",
                "我想问下有什么任务可以接的吗",
                "我查一下……诸位没有在这里执行过任务诶，那从驱逐野猪开始怎么样？",
                "诶~~这也太简单了吧，有没有更难的任务吗？",
                "这……我们王城公会为了提高任务的成功率，不会给陌生的勇者难度高的任务的……",
                "呃呃，好吧，我们考虑一下……",
                "……我听说最近有勇者竞技的活动，那是什么？",
                "那是整个王国中勇者团最高的竞技活动，优胜的人可以得到国王的赏赐哦",
                "要是你们可以在这个竞技中取得好成绩，这里的任务都会拜托你们来挑战哦",
                "这个竞技活动报名没有限制吗？",
                "没有啊，但是这个竞技不但会考验你们的力量，还会考验你们的智慧哦",
                "好，那我们就报名吧，你们怎么看？",
                "没问题啊~",
                "ok……",
                "好的，请帮我们报名吧，工会主管~",
                "好吧，不过可别小看了这个竞技哦……",
                "那么，竞技活动将在王城东边开始，你们也过去吧~"
            },
            new string[17]{
                "勇者工会主管",
                "帕吉尔",
                "勇者工会主管",
                "克萝莉亚",
                "勇者工会主管",
                "帕吉尔",
                "帕吉尔",
                "勇者工会主管",
                "勇者工会主管",
                "帕吉尔",
                "勇者工会主管",
                "帕吉尔",
                "克萝莉亚",
                "西露达",
                "帕吉尔",
                "勇者工会主管",
                "帕吉尔"
            },
            new int[17]{3,2,3,0,3,2,2,3,3,2,3,2,0,1,2,3,2})
        },
        { 1022, new Essay(
            new string[1]{
                "（三个王城任务）"
            },
            new string[1]{
                ""
            },
            new int[1]{3})
        },
        { 1023, new Essay(
            new string[11]{
                "诶呀，这不是新一届勇者竞技的优胜者们吗~",
                "哈哈，确实那场竞技是一场恶战呢……",
                "话说勇者们，这里有一些非常有挑战性的任务哦，有没有兴趣啊",
                "完全变了一个语气诶……",
                "那么有什么任务呢?",
                "我们需要你们深入魔界去猎杀魔狼，取得它们的精血，只要5瓶就可以了",
                "猎杀……吗……",
                "深入魔界吗……嘛，去一次魔界也挺好的啊",
                "好吧，那我们就接受了！",
                "好吧……我对魔界确实有兴趣……",
                "魔界和人界，有什么区别呢……"
            },
            new string[11]{
                "勇者工会主管",
                "帕吉尔",
                "勇者工会主管",
                "克萝莉亚",
                "帕吉尔",
                "勇者工会主管",
                "西露达",
                "克萝莉亚",
                "帕吉尔",
                "西露达",
                "西露达"
            },
            new int[11]{3,2,3,0,2,3,1,0,2,1,1})
        },
        { 1024, new Essay(
            new string[24]{
                "居然能完成这个任务，我果然没有看错人啊",
                "魔界中的怪物，实在是强啊……",
                "魔界对人类真的是一点都不欢迎啊，一见到我们就对我们全力攻击",
                "魔界的怪物，它们的眼神中……",
                "只剩下愤怒……和怨恨……",
                "接下来，是最终任务了，王后需要龙息来制作最强的宝石饰品，这个任务，已经分发给很多王城公会认可的勇者了，可是，直到现在龙息还是没有凑齐……",
                "要挑战的，当然是魔界最强的龙啦，要是可以屠龙的话，可是作为勇者最高的荣耀哦~",
                "什么啊，这个任务只是王后的一时任性吗，为了这个就要勇者出去拼命吗……",
                "其实，最后与龙交手，也是我的一个小梦想啊",
                "帕吉尔，你的意思还要去吗？感觉很危险诶！你已经成为人人尊敬的勇者了诶，这样不就好了吗？",
                "是啊，我觉得也已经够了……",
                "那为什么……",
                "我确实觉得我作为勇者已经可以退出了，但是毕竟勇者是我最初的目标",
                "实现最初的梦想的最高荣誉，对我也是有极大的吸引力啊",
                "我也想去……",
                "诶？",
                "我只是对魔界生物的想法感兴趣……",
                "而且，我们也不需要屠龙。",
                "龙息是龙最终的一击的衍生物，听说龙三天可以释放一次龙息",
                "只要将龙逼至绝境，就可以收集到龙息了",
                "而且听说龙是智慧的生物，希望与他们交战可以了解魔界……",
                "好吧，好吧，既然我们是一个小队的同伴，我就舍命陪君子吧……",
                "好吧，那我们接受这个任务了，请允许我们通过最后一道封印吧~",
                "好的，我明白了，你们要加油啊~"
            },
            new string[24]{
                "勇者工会主管",
                "帕吉尔",
                "克萝莉亚",
                "西露达",
                "西露达",
                "勇者工会主管",
                "勇者工会主管",
                "克萝莉亚",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "帕吉尔",
                "西露达",
                "克萝莉亚",
                "西露达",
                "西露达",
                "西露达",
                "西露达",
                "西露达",
                "克萝莉亚",
                "帕吉尔",
                "勇者工会主管"
            },
            new int[24]{3,2,0,1,1,3,3,0,2,0,2,0,2,2,1,0,1,1,1,1,1,0,2,3})
        },
        { 1025, new Essay(
            new string[8]{
                "可恶的人类！你身上有龙息的味道啊",
                "是啊，那又怎么样，我们击败了好多龙，好不容易收集到龙息啊",
                "可恶啊，我要为它们报仇！",
                "要是你也想试试我们的实力，那就来吧！",
                "你们都冷静下吧……",
                "龙啊，我们并没有杀掉任何一条龙，取到龙息我们便收手了……",
                "何来报仇之言……",
                "废话少说！拿命来吧！"
            },
            new string[8]{
                "龙",
                "克萝莉亚",
                "龙",
                "帕吉尔",
                "西露达",
                "西露达",
                "西露达",
                "龙"
            },
            new int[8]{3,0,3,2,1,1,1,3})
        },
        { 1026, new Essay(
            new string[14]{
                "哈……怎么说，我们的实力，你应该清楚了吧",
                "可恶……看来我今天，要命丧于此了吗……",
                "即使是死，我也不会让你们人类逞心如意的……",
                "为什么呀……为什么这么执着吗？",
                "你们人类做的恶事还不够吗？",
                "在勇者封印变弱后，魔界的生物都没好日子过了",
                "你们为了魔界的材料大肆屠杀开采……",
                "弱一点的生物被人类驱逐到魔界深处才有安身之地",
                "就连我们龙，都有被捉到然后被你们当成生产龙息的工具的了……",
                "可恶啊，在百年前魔界被勇者打败，现如今就沦落到这个地步了吗……",
                "是这样吗……",
                "居然是这样吗……",
                "回去吧……",
                "可恶啊……"
            },
            new string[14]{
                "帕吉尔",
                "龙",
                "龙",
                "克萝莉亚",
                "龙",
                "龙",
                "龙",
                "龙",
                "龙",
                "龙",
                "克萝莉亚",
                "帕吉尔",
                "西露达",
                "龙"
            },
            new int[14]{2,3,3,0,3,3,3,3,3,3,0,2,1,3})
        },
        { 1027, new Essay(
            new string[29]{
                "回到勇者公会了啊……",
                "是啊，还是把任务交付了吧，虽然……",
                "感觉对王城……不，人类对魔界的做法不太让人舒服啊……",
                "是啊，要是被勇者公会一直分派这种任务的话，确实感觉不舒服啊",
                "结束吧，我们交付这个任务，回到原来的村庄吧",
                "是啊，在那里，我才感到我们做的是有意义的事情",
                "我有一个想法……",
                "是什么呢？",
                "我想要，重新加固勇者封印……",
                "诶~~~~~~~~",
                "西露达，你怎么会有这个想法，你秀逗了吗？",
                "……ヽ(`Д′)?……",
                "……唉，好吧，这个想法，和我的身世有关……",
                "我……其实是生活在魔界的人类……是勇者的后代…………",
                "虽然生活在魔界边缘，但是因为我们有着天生的魔力，所以在魔界也挺安全地生活着……",
                "可是某一天，魔界封印变弱了，人界的人类闯了进来……",
                "于是不知怎么的，我们村落开始被魔界生物攻击……",
                "仅有几个族人逃到了人界……我还有艾斯迪儿，都是……",
                "原本只想着就这么在人界生活也就罢了……",
                "但是……现在知道了原因，就像最后弥补一下……让人魔两界可以互不干扰",
                "那……你知道勇者封印的方法吗？",
                "知道啊……",
                "什么，你还真的知道啊……",
                "相传使用我们族的秘法，传送到精灵之森……",
                "勇者封印的道具，就在那里……",
                "哇，冲击性的事实太多了，我得消化一会儿",
                "我想去，我觉得这样，才比较合理……",
                "好吧，这将是我们最后的大冒险了，我们就一起面对吧~",
                "那我们就在王城外传送吧，走吧……"
            },
            new string[29]{
                "西露达",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "西露达",
                "克萝莉亚",
                "西露达",
                "克萝莉亚",
                "帕吉尔",
                "西露达",
                "西露达",
                "西露达",
                "西露达",
                "西露达",
                "西露达",
                "西露达",
                "西露达",
                "西露达",
                "克萝莉亚",
                "西露达",
                "帕吉尔",
                "西露达",
                "西露达",
                "帕吉尔",
                "克萝莉亚",
                "帕吉尔",
                "西露达"
            },
            new int[29]{1,2,0,2,0,2,1,0,1,0,2,1,1,1,1,1,1,1,1,1,0,1,2,1,1,2,0,2,1})
        },
        { 1028, new Essay(
            new string[12]{
                "没想到，今天的森林居然多了几位客人……",
                "这位是精灵吗，真是太神奇了！",
                "精灵小姐，我想要加固百年前勇者的封印，请问有什么办法吗？",
                "哦，百年前是吗……",
                "呵呵，没想到那个蛮小子居然被你们称为勇者了啊……",
                "当时他是使用精灵之弓，阻断了人魔两界的交互",
                "精灵之弓是精灵的秘宝，可不能给你们随便使用啊",
                "是吗……",
                "不过看得出来，你们并不是为了私利想要使用秘宝……",
                "这样吧，通过精灵之森的考验，我便将精灵之弓借与你吧……",
                "好吧，那我们就接受吧",
                "那我们走吧~"
            },
            new string[12]{
                "精灵",
                "克萝莉亚",
                "西露达",
                "精灵",
                "精灵",
                "精灵",
                "精灵",
                "西露达",
                "精灵",
                "精灵",
                "帕吉尔",
                "克萝莉亚"
            },
            new int[12]{3,0,1,3,3,3,3,1,3,3,2,0})
        },
        { 1029, new Essay(
            new string[26]{
                "你们通过考验了啊……",
                "那就按照之前的约定，将精灵之弓借于你们吧……",
                "至于这把弓封印的使用方法……",
                "只要找到封印之庭，使用精灵之弓将注入灵力的箭射入，就可以加固封印了……",
                "不过……当有人使用了使用了精灵之弓……",
                "人界的灵力将不足以支撑起他的存在，所到之处可能会树木枯萎，百花凋零……",
                "要修炼很久，才可以控制这个力量……",
                "要是回到人界，有封印的情况下，就没有办法来到魔界和这里了……",
                "难怪，勇者最后会在魔界生活……",
                "勇者再还精灵之弓的时候，身边还跟着和他在一起的魔王呢~",
                "天哪……人界传说勇者与魔王同归于尽，没想到……",
                "原来，我在的村落，是勇者和魔王的后代吗……",
                "怪不得，西露达你会有这么厉害的魔力啊……",
                "使用精灵之弓，也需要很高的技巧啊，从刚才的对战来看……",
                "你们之中，克萝莉亚似乎可以使用吧……",
                "只有我吗……",
                "使用之后就暂时无法回到人界吗……",
                "抱歉，这个代价确实有点大……",
                "要不……",
                "我们三人，在封印成功之后，向百年前的勇者一样，暂时不要回人界了吧",
                "作为勇者，我确实已经有了做出一点牺牲的准备了……",
                "可是队友不得不做出点牺牲，还是要我坐立不安啊",
                "所以，你就提出，我们三人一起做出牺牲吗？",
                "好傻啊~",
                "好吧，我明白了……那我们走吧，去寻找封印之庭吧~",
                ""
            },
            new string[26]{
                "精灵",
                "精灵",
                "精灵",
                "精灵",
                "",
                "精灵",
                "精灵",
                "精灵",
                "精灵",
                "西露达",
                "精灵",
                "克萝莉亚",
                "西露达",
                "帕吉尔",
                "精灵",
                "精灵",
                "克萝莉亚",
                "克萝莉亚",
                "西露达",
                "帕吉尔",
                "帕吉尔",
                "帕吉尔",
                "帕吉尔",
                "克萝莉亚",
                "克萝莉亚",
                "克萝莉亚"
            },
            new int[26]{3,3,3,3,3,3,3,3,3,1,3,0,1,2,3,3,0,0,1,2,2,2,2,0,0,0})
        },
        { 1030, new Essay(
            new string[16]{
                "好久不见了啊，帕吉尔，你们在这里干什么？",
                "我们打算完成我们勇者团，最后一个任务~",
                "为什么说是最后一个任务啊……",
                "其实，我们经历了这么多冒险，感觉已经可以从勇者这个职业退下来了……",
                "啊？你们怎么会有这样的想法啊",
                "确实，我已经能从你们身上感到一股深不见底的力量",
                "难不成你们获得了什么神器吗……",
                "嘛，差不多吧~",
                "（这个力量，好像来自精灵之森啊）",
                "你们冒险居然到了百年前勇者封印人魔两界的精灵之森，确实你们的经历很丰富啊……",
                "是啊，我们打算，作当年勇者一样的事情……",
                "说不定，这里就是我们最后一次见面了~",
                "你们要封印人魔两界？封印不是还在这里吗",
                "我们要加固封印，从此人魔两界一段时间内就完全不能相互往来了哦",
                "…………",
                "那么，我们就先行一步啦~"
            },
            new string[16]{
                "塞拉斯",
                "帕吉尔",
                "塞拉斯",
                "帕吉尔",
                "塞拉斯",
                "塞拉斯",
                "塞拉斯",
                "帕吉尔",
                "艾斯迪儿",
                "艾斯迪儿",
                "帕吉尔",
                "帕吉尔",
                "塞拉斯",
                "克萝莉亚",
                "塞拉斯",
                "帕吉尔"
            },
            new int[16]{3,2,3,2,3,3,3,2,3,3,2,2,3,0,3,2})
        },
        { 1031, new Essay(
            new string[17]{
                "这里就是封印之庭吗……",
                "我们冒险的终点……",
                "让我拉开精灵之弓吧…………",
                "等等！！",
                "塞拉斯，你怎么会在这里",
                "别忘了，我们队伍里也有勇者的后裔……",
                "话说，我考虑了一下，觉得不可以让你们加固封印……",
                "为什么？？难道你看不出来，现在是人类侵略魔界，再这样下去魔界生物难以为生吗",
                "这件事我才不管！",
                "我只知道，没有魔界，我们所有勇者，将会消失……",
                "消失？",
                "确实，没有魔界，勇者会失业……",
                "没有冒险上的要求，勇者就会消失……",
                "是啊！我可不想这样！所以，我要阻止你们！",
                "艾斯迪儿，你也要帮她吗……",
                "西露达，我也有我的羁绊啊，每个人的际遇不同啊……",
                "好吧，看你们能阻止我们吗？"
            },
            new string[17]{
                "帕吉尔",
                "西露达",
                "克萝莉亚",
                "塞拉斯",
                "帕吉尔",
                "塞拉斯",
                "塞拉斯",
                "克萝莉亚",
                "塞拉斯",
                "塞拉斯",
                "克萝莉亚",
                "西露达",
                "西露达",
                "塞拉斯",
                "西露达",
                "艾斯迪儿",
                "克萝莉亚"
            },
            new int[17]{2,1,0,3,2,3,3,0,3,3,0,1,1,3,1,3,0})
        },
        { 1032, new Essay(
            new string[10]{
                "你们输了……",
                "我们相信我们是对的……即使勇者消失，我们也觉得，这才是我们文明的人类应该做的……",
                "我们输了……",
                "我觉得，有了魔界，我们人类才会团结……",
                "勇者消失……对这个世界的影响是未知的……",
                "现在这个世界，其实很好啊，我不希望这样的世界有所改变……",
                "不过，既然我们输了……那就随你们了…………",
                "塞拉斯……",
                "克萝莉亚，去吧，封印人魔两界吧！",
                "好~~"
            },
            new string[10]{
                "帕吉尔",
                "克萝莉亚",
                "塞拉斯",
                "塞拉斯",
                "塞拉斯",
                "塞拉斯",
                "塞拉斯",
                "帕吉尔",
                "帕吉尔",
                "克萝莉亚"
            },
            new int[10]{2,0,3,3,3,3,3,2,2,0})
        },
        { 1033, new Essay(
            new string[2]{
                "最后，人魔两界重新封印，人类无法染指魔界，魔界也对人类再无威胁。",
                "如同塞拉斯所预料的那样，勇者公会没有了任务发布，人类勇者渐渐消失"
            },
            new string[2]{
                "",
                ""
            },
            new int[2]{3,3})
        },
        { 1034, new Essay(
            new string[2]{
                "而我们的克萝莉亚，西露达，帕吉尔，在西露达的村落中，过着安逸的生活",
                "最后的阿尔西斯勇者们，走向了属于他们的结局"
            },
            new string[2]{
                "",
                ""
            },
            new int[2]{3,3})
        },
        { 1035, new Essay(
            new string[2]{
                "呼~终于把挑战的无名之辈打败了……",
                "来问问国王下一个考验是什么吧……"
            },
            new string[2]{
                "帕吉尔",
                "帕吉尔"
            },
            new int[2]{2,2})
        },
        { 1036, new Essay(
            new string[2]{
                "你们挺厉害的啊，接下来，要是能将我最亲信的士兵打败，这一届的勇者竞技的冠军就是你们了",
                "好吧，来吧！"
            },
            new string[2]{
                "国王",
                "帕吉尔"
            },
            new int[2]{3,2})
        },
        { 1037, new Essay(
            new string[3]{
                "好啊，没想到我国内居然还有这样的青年才俊……",
                "这一届的勇者竞技的冠军就是你们了",
                "嘿嘿，这下，那个勇者工会的人就不会敷衍我们了吧……"
            },
            new string[3]{
                "国王",
                "国王",
                "帕吉尔"
            },
            new int[3]{3,3,2})
        },
        { 1038, new Essay(
            new string[2]{
                "前面就是黑暗森林了……",
                "小心迷路……"
            },
            new string[2]{
                "帕吉尔",
                "帕吉尔"
            },
            new int[2]{2,2})
        },
    };
    
    void Start()
    {

    }

    // Update is called once per frame
    void Update()
    {

    }

    public Essay GetNpcTextByID(int id)
    {
        //Debug.Log("GetNpcTextByID" + id + " "+ m_EssayInfo.Count);
        if (id == 0)
            return null;
        return m_EssayInfo[id];
    }
}
